Wikitutorials/tutorials/compressible/rhoPimpleFoam/laminar/blockedChannel/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

volumeFraction
{
    type            volumeFractionSource;
    phase           solid;
    phi             phi;
    rho             rho;
    U               U;
    fields          (rho U e);
}

solidEquilibriumEnergy
{
    type            solidEquilibriumEnergySource;
    phase           solid;
    field           e;
}

// ************************************************************************* //
